<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>


<main>
   <h2 class="main title">가입동의</h2>
   
   <div class="breadcrumb" style="margin-top:-20px;">
      <h3 class="hidden">경로</h3>
      <img src="../resource/images/member/step1.png" alt="회원가입 1단계" />
   </div>
   
   <div class="margin-top first">
   
      <div class="bg-light-gray border-gray padding" style="">
        <div class="padding font-size-13 text-strong">
               뉴렉쳐의 <span class="text-orange">개인정보 수집 및 이용</span>에 대한 안내입니다. 불편하신 사항이 없으시도록 꼭 읽어주시기 바랍니다.
        </div>
        <div class="agree-content">
            <textarea style="width:100%;height: 300px">[ 이용약관 제1장 - 총칙 ]

제1조 (목적)
이 약관은 뉴렉처(http://www.newlecture.com) 사이트가 제공하는 모든 서비스의 이용 조건 및 절차에 관한 사항과 기타 필요한 사항을 전기통신사업법 및 동법 시행령이 정하는 대로 준수하고 규정함을 목적으로 합니다.

제2조 (약관의 효력과 발생)
이 약관은 이용자에게 공시함으로써 효력을 발생하며 뉴렉처 사이트의 사정에 의해 변경될 수 있으며, 변경된 약관 또한 공시함으로써 효력을 발생합니다.

제3조 (약관 외의 준칙)
이 약관에 명시되지 않은 사항이 관계 법령에 규정되어 있을 경우에는 그 규정에 따릅니다.

제4조 (약관의 변경)
1) 뉴렉처 는(은) 약관을 수정할 권한이 있습니다.
2) 약관의 변경 시, 공지사항에 공시 후에 효력이 발생합니다.
3) 약관의 변경일자는 부칙에 명시합니다.

[ 이용약관 제2장 - 회원가입 및 서비스이용 ]

제1조 (서비스 이용 계약 및 성립)
회원 가입에 대한 뉴렉처 사이트의 이용 승낙으로 계약이 성립이 되며, 이에 대한 기본 전제 조건으로 약관에 기재된 내용에 대한 동의를 전제 조건으로 합니다.

제2조 (서비스 이용)
1) 특별한 일이 없을 경우 수강신청일로 부터 수강기간 종료일까지 24시간 서비스 이용을 원칙으로 합니다.
2) 시스템 점검 및 업그레이드 등의 특별한 경우, 24시간 이전에 사전 통지함을 원칙으로 합니다.

제3조 (서비스의 중지)
1) 뉴렉처는(은) 서비스제공에 필요한 설비의 보수, 교체, 장애 등의 사유가 발생시 그 내용을 이용자에게 공시하고, 서비스를 일시적으로 중지할 수 있습니다.
2) 국가의 비상사태, 정전, 기타 뉴렉처 사이트의 관리범위 외의 설비 장애 및 기타 불가항력적인 요인에 의해 데이터에 손실이 있을 경우에 뉴렉처는(은) 관련책임을 부담하지 않습니다.


[ 이용약관 제3장 - 의무 ]

제1조 (회사의 의무)
1) 특별한 일이 없을 경우 회원 등록 시, 바로 서비스를 이용할 수 있도록 합니다.
2) 회원가입은 무료입니다.
3) 회원이 안정적인 서비스 이용을 할 수 있도록 노력합니다.
4) 회원의 개인 정보 유출을 막으며, 보안 유지에 각별히 유의합니다.
5) 회원의 정보를 다른 목적으로 쓰지 않아야 합니다.

제2조 (회원의 의무)
1) ID와 패스워드에 관한 모든 관리책임은 회원에게 있습니다.
2) 자신의 ID가 도용 당했을 경우에는 그 사실을 뉴렉처 회사에 통보해야 합니다.
3) 서비스 이용시, 다른 회원으로 인해 불이익을 당했을 경우 그 사실을 뉴렉처 회사에 통보해야 합니다.
4) 회원은 약관에 명시된 사항을 준수하여야 합니다.
5) 뉴렉처 사이트에 기재된 내용은 타사이트에 쓸 수 없으며, 자료 및 이미지에 대한 사용권은 해당 자료를 올린 사람과 뉴렉처 사이트에 있습니다.
6) 서비스 이용시, 특정 프로그램들과 개인적인 특수한 S/W의 사용으로 서비스 장애가 일어나지 않게끔 해야합니다.
7) 최초 시스템 OS 설치 후 일반적으로 사용하는 공식경로의 S/W를 설치하여 안정적으로 시스템을 사용하실 것을 요청합니다.
8) 서비스 장애발생시 해당 컴퓨터시스템의 안정성 여부를 체크해주시기 바랍니다.
9) 오랜기간 시스템 정비 등을 안한 경우 서비스 접속 불안정의 원인과 원인모를 서비스 충돌의 원인이 될 수 있습니다.
10) 강좌의 이용은 1인 1PC로 이용합니다.


[ 이용약관 제4장 - 계약해지 ]

제1조 (계약해지)
1) 회원 등록해지(탈퇴)를 원하는 회원은 개인정보수정에서 회원탈퇴를 할 수 있습니다.
2) 한 번 탈퇴한 ID는 재사용이 불가능하나 경우에 따라 사용할 수도 있습니다.
3) 다음의 하나에 해당하는 경우, 뉴렉처 사이트에서 임의로 탈퇴 처리를 할 수 있습니다.
①. 게시판에 욕설 등의 비속어를 썼을 경우
②. 타인의 강의를 무단복제 및 도용한 경우
③. 도배성 및 광고성 글을 기재했을 경우
④. 타인의 ID 및 비밀번호를 도용한 경우
⑤. 타인에게 ID 및 비밀번호를 빌려준 경우
⑥. 타인의 명예를 손상시킨 경우나 불이익을 주었을 경우
⑦. 게시판에 개인사견 및 오해의 소지가 있는 글을 올린 경우
⑧. 해킹, 컴퓨터 바이러스 등 안정적인 서비스 제공에 지장을 초래한 경우
⑨. 회원 등록 정보를 허위로 작성한 경우
4) 뉴렉처 사이트에서 임의로 탈퇴 처리를 할 경우는 그에 대한 사유를 문의하시면 알려드립니다.

제2조 (해지 및 환불)
1) 온라인 동영상교육 콘텐츠라는 특성상 결제(무통장입금 포함) 이후에는 환불이나 취소가 되지 않습니다.
①. 본 1)항의 규정은 &lt;제 2 조&gt;
모든 하위 항목에 대해서 최우선권을 가집니다.
②. 콘텐츠에 대한 결제 이후 만 12시간 이내에는 취소 및 환불이 가능합니다.
③. 콘텐츠에 대한 결제 이후 만 12시간 이후에는 취소 및 환불이 불가능합니다.
2) 중도에 회사의 사유상 계약을 이행하지 못할시에는 수강생에게 그에대한 적절한 조취를 회사가 취해드립니다.
3) 기타사항
①. 택배 등의 배송을 통한 &lt;cd&gt;
, &lt;dvd&gt;
, &lt;도서&gt;
등의 배송상품의 경우 계약일로부터 7일 경과 후 환불요청시는 환불되지 않습니다.
②. 콘텐츠의 이상이 아닌 개인 PC상태의 이상으로 인한 것은 개인PC의 OS 등 시스템을 새로 설치해서 보셔야 합니다.


[ 이용약관 제5장 - 게시물의 저작권 ]

1) 게시자가 게시하는 모든 게시물은 게시자의 창의적인 산물임을 내포합니다.
2) 게시자는 게시물 등록 전에 저작권 등 게시물과 관련한 제반사항에 대해 반드시 확인하여야 합니다.
3) 게시물의 저작권 및 모든 권리와 책임은 게시물에 별도 표기한 경우를 제외하고는 해당 게시물의 게시자에게 있습니다.
4) 게시자는 게시물의 저작권 등 제반 법적침해로 발생하는 피해에 대한 보상의 모든 책임을 가지며, 회사는 어떠한 책임도 부담하지 않습니다.
5) 뉴렉처 사이트는 게시된 내용을 사전 통지 없이 편집, 가공, 이동 할 수 있는 권리를 가집니다.
6) 게시물의 유포 등을 통해 뉴렉처 사이트의 피해가 예상되거나 피해가 발생할 경우 뉴렉처 사이트는 즉시 해당 유포물의 삭제를 해당 유포자에게 요구할 수 있으며, 유포자는 즉시 해당 유포물을 파기해야 합니다.
7) 회사가 직접 또는 간접적으로 제공하는 서비스를 이용하는 이용자는 서비스를 이용하여 얻은 정보를 가공, 판매하는 행위 등 서비스에 게재된 자료를 상업적으로 사용할 수 없습니다.


[ 이용약관 제6장 - 개인정보보호 ]

1) 개인정보 보호는 뉴렉처 회사의 개인정보 보호정책을 따릅니다.
2) 뉴렉처는(은) 사용자가 스스로 게시하는 게시물 상에서 사용자 스스로 기입하는 개인정보의 유출로 인한 피해에 대해서는 책임지지 않습니다.


[ 이용약관 제7장 - 기타 ]

제1조 (소유권)
뉴렉처 회사가 승인한 경우를 제외하고는 1)의 각 재산에 대한 수정, 대여, 판매, 배포, 제작, 라이센스, 상업적이용 행위를 할 수 없으며, 제 3자에게 그와 같은 행위를 할 수 있게 허락할 수 없습니다.

제2조 (양도금지)
이용자가 뉴렉처 사이트의 서비스에 대한 이용권한, 기타 이용계약상의 지위를 타인에게 양도, 증여할 수 없으며, 이를 담보로 제공할 수 없습니다.

제3조 (손해배상)
회사가 제공되는 서비스와 관련하여 당사가 고의적으로 행한 범죄행위를 제외하고, 이용자에게 어떠한 손해가 발생하더라도 그에 대해 책임을 부담하지 않습니다.

제4조 (면책조항)
회사는 이용자 상호간 또는 이용자와 제 3자 상호간에 당사의 서비스와 관련해 발생한 분쟁에 대하여 개입할 의무가 없으며, 이로 인한 손해를 배상할 책임도 없습니다.

제5조 (관할법원)
회사가 제공하는 서비스와 관련 발생한 분쟁에 대해 소송이 제기될 경우 회사 소재지를 관할하는 법원을 전속 관할 법원으로 합니다.


상기약관은 2014년 07월 01일부터 효력이 발생됩니다.

            </textarea>
        </div>
    </div>
   
   
      
      <div style="color:red;">
         약관에 동의를 하지 않았습니다. 약관에 동의를 해주어세요.
      </div>
      
      <form action="agree" method="post" class="margin-top">
         <div>
            <input type="checkbox" name="agree" value="true" /> 약관에 동의합니다.
         </div>
         <div class="margin-top text-align-center">
            <input type="hidden" name="${_csrf.parameterName}" value="${_csrf.token}" />
            <input id="submit-button" class="btn-text btn-default" style="height: 40px; width: 100px; font-size: 13px;" type="submit" value="다음" />
         </div>
      </form>
   </div>
   
</main>

<script>
	window.addEventListener("load",function(){

	var submitButton = document.querySelector("#submit-button");
    var agreeCheckbox = document.querySelector("input[name='agree']");

    submitButton.onclick = function(e){
    	
        e.preventDefault();
        
        if(!agreeCheckbox.checked){
            alert("동의를 하지 않았습니다");
            return;
        }
        
        location.h	ref = "join";
    };
});
</script>